# coding=utf-8
from __future__ import unicode_literals

rules_part1 = '''
Грати дуже просто! Два гравці ходять по черзі, заповнюючи вільні клітини поля розміром 3х3 хрестиками (Х) і нуликами (О). Гравець, який розмістив 3 своїх знака по вертикалі, горизонталі або діагоналі, виграє.
_ | _ | _
_ | _ | _
_ | _ | _
'''

rules_part2 = '''У кожної клітини свій номер:
1 | 2 | 3
4 | 5 | 6
7 | 8 | 9
Щоб зробити хід, просто введи цифру. Вперед!
'''

rules_option = '''
Зіграємо в Хрестики-нулики?
Щоб дізнатися, як грати, напиши RULES.
Для початку гри напиши цифру від 1 до 9
'''

ask_for_move = "Твій хід!"

valid_move_string = "Щось не те. Введи належну цифру"

space_occupied = "Ця клітина зайнята. Введи іншу цифру"

rule_string = 'RULES'

win_message = 'Ура!!! Перемога твоя!'

lose_message = 'Ой, тобі не пощастило цього разу'

tie_message = 'Це була партія кота!'

expected_greetings = ['привіт', 'прів', 'добрий день', 'добрий ранок', 'добрий вечір', 'здравстуй', 'здравстуйте',
                      'хай', 'хей', 'хелло', 'йоу']
language = ['language', 'ru', 'en']
rules_request = ['rules', 'help']
start = ['play', 'start']
turn = ['\d']

greeting_reaction = 'greeting reaction ru'
greeting_reactions = ['Салют, {username}. Зіграємо?',
                      'Привіт! Давай грати',
                      'Бонжур. Хочеш зіграти?',
                      'Привіт-привіт! Давай вже грати',
                      'Хей, {username}, радий тебе знов бачити! Почнемо?',
                      'Йоу, {username}. Тисни вже Play!'
                      ]
late_greeting_reaction = 'late greeting reaction ru'

ask_again = ['Щось я тебе не розумію',
             'Начебто я вчора не пів, але мозок погано працює. Що-що?',
             'Що ти маєш на увазі?',
             'Можеш повторити те саме, але іншими словами?',
            ]

lang_confirmation = 'Мова змінена'

good_start = 'Непоганий початок!'

one_left = 'Камон, залишився лише один хід!'

propose_emojis = "Як ти ставишся до того, щоб пограти з полуничкою?:)"

human_requests = ['купит',
                  'поддержк',
                  'говорит',
                  'общаться',
                  'уточн',
                  'оператор',
                  'менеджер',
                  'заказ',
                  'телефон',
                  'замовлення',
                  'артикул',
                  'налич',
                  'магазин']

prompt_human_request = "Ви хочете поговорити з менеджером магазину GameClub?"
confirm_human = 'Я зараз покличу когось, хто зможе з вами поговорити. А поки напишіть, що саме ви хочете уточнити'

stats = 'Зіграно: {total}\nПеремоги: {wins}\nНічиї: {ties}\nПоразки: {losses}'

prompt_for_new_game = (
'Перед тим, як почати нову гру, я хочу переконатися, що ти знаходишся в тверезому розумі й твердій пам\'яті. Точно хочеш почати нову гру?',
'Повернутися до гри', 'Нова гра')
basic_prompt = ('Точно?', 'Відміна', 'Так')

id_request = ['SHOW MY ID PLEASE']